# ▼▲▼ XRXS_MP 7. 全メニュー半透明化＋メニュー背景 ▼▲▼
# by 桜雅 在土

#==============================================================================
# カスタマイズポイント
#==============================================================================
module XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ○ スプライトセットを作成
  #--------------------------------------------------------------------------
  def create_spriteset
    @spriteset_bgmap        = Sprite.new
    @spriteset_bgmap.bitmap = RPG::Cache.title("MenuBack")
    #case self
    #when Scene_File, Scene_End
    #  @spriteset_bgmap        = Sprite.new
    #  @spriteset_bgmap.bitmap = RPG::Cache.title("001-Title01")
    #else
      #@spriteset_bgmap        = Spriteset_Map.new
    #end
  end
  #--------------------------------------------------------------------------
  # ○ スプライトセットを解放
  #--------------------------------------------------------------------------
  def dispose_spriteset
    @spriteset_bgmap.dispose
  end
end
#==============================================================================
# ■ Window_Base
#==============================================================================
class Window_Base < Window
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  alias xrxs_mp7_initialize initialize
  def initialize(x, y, width, height)
    xrxs_mp7_initialize(x, y, width, height)
    if $scene.is_a?(Scene_Menu) or
       $scene.is_a?(Scene_Item) or
       $scene.is_a?(Scene_Skill) or
       $scene.is_a?(Scene_Equip) or
       $scene.is_a?(Scene_Status) or
       $scene.is_a?(Scene_Shop) or
       $scene.is_a?(Scene_MonsterBook) or
       $scene.is_a?(Scene_File) or
       $scene.is_a?(Scene_End)
      self.back_opacity = 160
    end
  end
end


#==============================================================================
# ■ Scene_MonsterBook
#==============================================================================
class Scene_MonsterBook
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end

#==============================================================================
# ■ Scene_Menu
#==============================================================================
class Scene_Menu
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_Item
#==============================================================================
class Scene_Item
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_Skill
#==============================================================================
class Scene_Skill
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_Equip
#==============================================================================
class Scene_Equip
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_Status
#==============================================================================
class Scene_Status
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_File
#==============================================================================
class Scene_File
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_End
#==============================================================================
class Scene_End
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
#==============================================================================
# ■ Scene_Shop
#==============================================================================
class Scene_Shop
  include XRXS_MP7_Module
  #--------------------------------------------------------------------------
  # ● メイン処理
  #--------------------------------------------------------------------------
  alias xrxs_mp7_main main
  def main
    create_spriteset
    xrxs_mp7_main
    dispose_spriteset
  end
end
